In [1]:
import pandas as pd

In [30]:
data = pd.read_csv("./Bengaluru_House_Data.csv")
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [32]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [33]:
data.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [34]:
df1 = data[['size', 'total_sqft', 'bath', 'balcony', 'price']]

In [35]:
df1.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

In [36]:
df1.isna().sum()

size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [37]:
df1.shape

(13320, 5)

In [38]:
df1.dropna(inplace=True)

C:\Users\muham\AppData\Local\Temp\ipykernel_15432\3614008390.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.dropna(inplace=True)

In [39]:
df1['beds'] = df1['size'].str.split(" ").str[0].astype("int")

C:\Users\muham\AppData\Local\Temp\ipykernel_15432\815216761.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['beds'] = df1['size'].str.split(" ").str[0].astype("int")

In [40]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12711 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   size        12711 non-null  object
 1   total_sqft  12711 non-null  object
 2   bath        12711 non-null  float64
 3   balcony     12711 non-null  float64
 4   price       12711 non-null  float64
 5   beds        12711 non-null  int32
dtypes: float64(3), int32(1), object(2)
memory usage: 645.5+ KB

In [43]:
df1.drop(columns='size', inplace=True)

C:\Users\muham\AppData\Local\Temp\ipykernel_15432\1455315890.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop(columns='size', inplace=True)

In [44]:
df1.columns

Index(['total_sqft', 'bath', 'balcony', 'price', 'beds'], dtype='object')

In [45]:
df2 = df1[['total_sqft', 'bath', 'balcony', 'price', 'beds']]

In [49]:
len(df2['total_sqft'])

12711

In [67]:
df2[~df2['total_sqft'].str.isnumeric() | ~df2['total_sqft'].str.isdecimal()]

        total_sqft  bath  balcony    price  beds
30     2100 - 2850   4.0      0.0  186.000     4
44         1330.74   2.0      2.0   91.790     2
122    3067 - 8156   4.0      0.0  477.000     4
137    1042 - 1105   2.0      0.0   54.005     2
142        1563.05   3.0      1.0  105.000     3
...            ...   ...      ...      ...   ...
12990  1804 - 2273   3.0      0.0  122.000     3
13059  1200 - 1470   2.0      0.0   72.760     2
13123      1331.95   2.0      2.0   69.000     2
13265  1133 - 1384   2.0      0.0   59.135     2
13299  2830 - 2882   5.0      0.0  154.500     4

[272 rows x 5 columns]

In [69]:
df2[~df2['total_sqft'].str.match(r'^\d+(\.\d+)?$')]

        total_sqft  bath  balcony    price  beds
30     2100 - 2850   4.0      0.0  186.000     4
122    3067 - 8156   4.0      0.0  477.000     4
137    1042 - 1105   2.0      0.0   54.005     2
165    1145 - 1340   2.0      0.0   43.490     2
188    1015 - 1540   2.0      0.0   56.800     2
...            ...   ...      ...      ...   ...
12975   850 - 1060   2.0      0.0   38.190     2
12990  1804 - 2273   3.0      0.0  122.000     3
13059  1200 - 1470   2.0      0.0   72.760     2
13265  1133 - 1384   2.0      0.0   59.135     2
13299  2830 - 2882   5.0      0.0  154.500     4

[186 rows x 5 columns]